src/gentoo-ins.org
#+TITLE: Gentoo Linux实用指北

* 关于本文

本文是对笔者4个月来折腾Gentoo Linux的一个总结，包括了安装、优化以及配置的内容。需要注意：

 1. 文中所述都是关于Amd64架构下Gentoo Linux的安装和配置；
 2. 本文不是[[https://wiki.gentoo.org/wiki/Handbook:AMD64][Gentoo Handbook]]，请确保在安装之前／之后阅读该官方手册（建议食用英文版、中文版部分翻译不全且过时）；
 3. 本文针对的是笔记本电脑安装桌面系统，内核配置、电源管理、桌面系统安装等部分视个人情况而定；
 4. 笔者电脑配置为：CPU、GPU分别为牙膏厂12代的i5和iRISxe，使用英伟达显卡的读者可能需要另行检索有关信息；使用UEFI。
 5. 安裝的是OpenRC、Clang编译并手動配置內核、內附基於X11的XMonad以及Wayland的swayWM入土級指北。

* 基础系统安装

** 准备安装环境

*** 引导

为了完成Gentoo Linux的安装、首先我们肯定要制作一个系统引导盘（LiveUSB）。Gentoo Linux的安装跟大部分发行版的不同之处就在于它并没有提供一个有GUI或TUI界面作为安装向导的引导盘。相反，为了最大程度地客制化，它只提供了一个内置各种安装系统必备工具的不包含图形界面的基础系统；我们需要在以LiveUSB启动后~chroot~至本机磁盘手动（一般情况下）完成安装。这种繁琐安装方式给予了其最大的灵活性，真正意义上的选择之多样是Gentoo一个非常大的优势。

我们可以从清华镜像源处获得LiveUSB的磁盘映像文件。官方提供了三种磁盘文件，这里我们一般选择install-amd64-mininal即可，文件地址在：我们可以从清华镜像源处获得LiveUSB的磁盘映像文件。官方提供了三种磁盘文件，这里我们一般选择~install-amd64-mininal~即可，文件地址在：

#+BEGIN_SRC
  https://mirrors.tuna.tsinghua.edu.cn/gentoo/releases/amd64/autobuilds/current-install-amd64-minimal/.
#+END_SRC

随后将该~iso~文件刻录到U盘上（经过了Hybrid处理，可以直接刻录到U盘上[fn::不像FreeBSD。]）。这里大家各显神通就好。谨慎的读者还可以校验一下磁盘映像文件的完整性、校验文件也在上面给出的地址下。之后将目标设备关机、插上制作好的引导盘后*先关闭SecureBoot后*启动。然后你会看到OpenRC引导这Gentoo Linux启动，至此我们就完成了第一步：引导。

*** 连接至网络

进入LiveUSB的环境后，先运行~ifconfig~，看看除了~lo~之外是否有别的网卡设备被检测到（比如~wlan~）。如果没有那说明你的网卡不被支持，可以到互联网上检索并寻求帮助。有的话就可以运行~net-setup~（自带的一个非常贴心的脚本），按照指引连接至网络。如果使用~wlan~，大部分网络都是WPA2/3，并建议让~dhcp~决定ip地址。

随后可以~ping~一下~gentoo.org~，看看自己是否成功联网。然后视需求编辑~/etc/reslov.conf~（默認可用的编辑器有nano）。

*** 磁盘分区

接下来是很重要的一步：给目标设备的磁盘分区。（确定你的电脑使用不是BIOS启动，如果是请参考Handbook）一般至少需要三个分区、分别是EFI分区（512MB~1024MB）、swap分区（主要是笔记本电脑休眠时使用，一般小于等于你的运行时内存大小即可）以及根分区。也是，大家各显神通就好；[[https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Disks][这里]]（Introduction to block devices至Partitioning the disk with MBR for BIOS / legacy boot）有Gentoo官方给出的方案，以及分区工具~fdisk~的手把手教学可供参考。下面给出我的方案、仅供参考：

#+BEGIN_SRC
  Disk /dev/nvme0n1: 476.94 GiB, 512110190592 bytes, 1000215216 sectors
  Disk model: [.*]
  Units: sectors of 1 * 512 = 512 bytes
  Sector size (logical/physical): 512 bytes / 512 bytes
  I/O size (minimum/optimal): 512 bytes / 512 bytes
  Disklabel type: gpt
  Disk identifier: [.*]

  Device            Start        End   Sectors   Size Type
  /dev/nvme0n1p1     2048    2099199   2097152     1G Linux filesystem
  /dev/nvme0n1p2  2099200    4196351   2097152     1G EFI System
  /dev/nvme0n1p3  4196352   37750783  33554432    16G Linux swap
  /dev/nvme0n1p4 37750784 1000214527 962463744 458.9G Linux filesystem
#+END_SRC

我额外分出了一个~/boot~分区，即~/dev/nvme0n1p1~。分完区后使用~fdisk -l /dev/[nvme0n1|sda|.*]~输出你的分区方案，最好记录一下，因为之后编辑~/etc/fstab~时会用到。

随后给这几个分区配置不同的文件系统。EFI分区须使用FAT32、其余参考[[https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Disks][这里]]（Creating file systems）。这是我的方案：

#+BEGIN_SRC shell
  mkfs.ext4 /dev/nvme0n1p1
  mkfs.vfat -F 32 /dev/nvme0n1p2
  swapon /dev/nvme0n1p3
  mkfs.btrfs /dev/nvme0n1p4
#+END_SRC

然后挂载根目录：

#+BEGIN_SRC shell
  mount /dev/nvme0n1p4 /mnt/gentoo
  cd /mnt/gentoo
#+END_SRC

顺便，Gentoo的LiveUSB是没有预装OpenZFS所需的工具的，这时候你就需要使用其它镜像，即所谓的特殊情况；注意如果选择了第三方的镜像，可能会需要额外的安装步骤，见GentooHandbook。

*** 选择stage3档案

关于stage3，他们是Gentoo系统安装的种子。这时你需要作出选择：

 * 不喜~systemD~？选择~OpenRC~；
 * 对~glibc~感到不适？选择~musl-llvm~（注意，没有gcc和~glibc~很多软件不打补丁是编译不起来的）；
 * 被迫害妄想症？选择+OpenBSD+​~hardened-selinux~；
 * 喜欢禁欲？选择~nomultilib~。

请选择你的毒药。stage3清单可在[[https://mirrors.tuna.tsinghua.edu.cn/gentoo/releases/amd64/autobuilds/][这里]]查看。

作出选择后可使用wget或cURL将其下载到~/mnt/gentoo~下：

#+BEGIN_SRC shell
  wget https://mirrors.tuna.tsinghua.edu.cn/gentoo/releases/amd64/autobuilds/current-stage3-amd64-desktop-openrc/stage3-amd64-desktop-openrc-*.tar.xz
#+END_SRC

谨慎的读者这时又可以校验一下磁盘映像文件的完整性了。然后使用：

#+BEGIN_SRC shell
  tar xpvf stage3-*.tar.xz --xattrs-include='*.*' --numeric-owner
#+END_SRC

解压。注意，一定要用这个命令解压。参数解释在Handbook中有，按需食用。

