cnt/gentoo-ins.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta name="generator" content=
"HTML Tidy for HTML5 for Apple macOS version 5.8.0">
<!-- 2024-10-15 Tue 08:07 -->
<meta charset="utf-8">
<meta name="viewport" content=
"width=device-width, initial-scale=1">
<title>Gentoo Linux实用指北</title>
<meta name="author" content="RadioNoiseE">
<meta name="generator" content="Org Mode">
<link rel="stylesheet" type="text/css" href="../res/style.css">
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Gentoo Linux实用指北</h1>
</header>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2f6d287">1. 关于本文</a></li>
<li><a href="#orgb674ea6">2. 基础系统安装</a>
<ul>
<li><a href="#org736adfe">2.1. 准备安装环境</a>
<ul>
<li><a href="#org60dd760">2.1.1. 引导</a></li>
<li><a href="#orgc2d9f9e">2.1.2. 连接至网络</a></li>
<li><a href="#org992e15b">2.1.3. 磁盘分区</a></li>
<li><a href="#org29e8a99">2.1.4. 选择stage3档案</a></li>
<li><a href="#org15e3437">2.1.5.
配置<code>make.conf</code>并换源</a></li>
<li><a href="#orgf717d9d">2.1.6. chroot</a></li>
<li><a href="#org6687a7c">2.1.7. BootStrap（可选）</a></li>
<li><a href="#orgc4c2f72">2.1.8. 从stage1到stage2</a></li>
<li><a href="#org9546d0a">2.1.9. 从stage2到stage3</a></li>
</ul>
</li>
<li><a href="#orgcbd68cb">2.2. 安装系统</a>
<ul>
<li><a href="#org7154c10">2.2.1. 同步包管理器数据库并选取全局配置文件</a></li>
<li><a href="#org76b8cf7">2.2.2.
配置<code>make.conf</code>文件</a></li>
<li><a href="#org2c5ebf8">2.2.3. 重建系统（可选）</a></li>
<li><a href="#orgfc002a0">2.2.4. 本地化</a></li>
</ul>
</li>
<li><a href="#org523d1d3">2.3. 配置系统内核（手动配置可选）</a>
<ul>
<li><a href="#org8a2a66d">2.3.1. 必要驱动安装</a></li>
<li><a href="#org0cdc41d">2.3.2. 发行版内核安装</a></li>
<li><a href="#org76b3b66">2.3.3. 手动编译内核</a></li>
</ul>
</li>
<li><a href="#orgc1d5792">2.4. 杂项、工具、及系统引导</a>
<ul>
<li><a href="#org12a1e6c">2.4.1. <code>fstab</code>文件</a></li>
<li><a href="#org354f8c8">2.4.2. 网络相关</a></li>
<li><a href="#org1fe71f0">2.4.3. 系统信息</a></li>
<li><a href="#org3288e6e">2.4.4. 系统工具</a></li>
</ul>
</li>
<li><a href="#orge2f16aa">2.5. 系统引导</a></li>
<li><a href="#orgc206d16">2.6. 清理</a></li>
</ul>
</li>
<li><a href="#org978b35f">3. 桌面环境的安装</a>
<ul>
<li><a href="#org122e7d3">3.1. 选择</a></li>
<li><a href="#org8cf5f94">3.2. XOrg与XMonad</a>
<ul>
<li><a href="#orgc774aa2">3.2.1. 安装必要软件</a></li>
<li><a href="#org0deb529">3.2.2. 配置</a></li>
<li><a href="#org50b8d85">3.2.3. 常见事故</a></li>
</ul>
</li>
<li><a href="#orgdd01664">3.3. Wayland与SwayWM</a>
<ul>
<li><a href="#orgb108423">3.3.1. 安装必要软件</a></li>
<li><a href="#org0d26175">3.3.2. 配置</a></li>
<li><a href="#org79b16f6">3.3.3. 常见问题</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7c45ee2">4. 吐槽与展望</a></li>
</ul>
</div>
</nav>
<div id="outline-container-org2f6d287" class="outline-2">
<h2 id="org2f6d287"><span class="section-number-2">1.</span>
关于本文</h2>
<div class="outline-text-2" id="text-1">
<p>本文是对笔者4个月来折腾Gentoo Linux的一个总结，包括了安装、优化以及配置的内容。需要注意：</p>
<ol class="org-ol">
<li>文中所述都是关于Amd64架构下Gentoo Linux的安装和配置；</li>
<li>本文不是<a href=
"https://wiki.gentoo.org/wiki/Handbook:AMD64">Gentoo
Handbook</a>，请确保在安装之前／之后阅读该官方手册（建议食用英文版、中文版部分翻译不全且过时）；</li>
<li>本文针对的是笔记本电脑安装桌面系统，内核配置、电源管理、桌面系统安装等部分视个人情况而定；</li>
<li>
笔者电脑配置为：CPU、GPU分别为牙膏厂12代的i5和iRISxe，使用英伟达显卡的读者可能需要另行检索有关信息；使用UEFI。</li>
<li>
安裝的是OpenRC、Clang编译并手動配置內核、內附基於X11的XMonad以及Wayland的swayWM入土級指北。</li>
</ol>
</div>
</div>
<div id="outline-container-orgb674ea6" class="outline-2">
<h2 id="orgb674ea6"><span class="section-number-2">2.</span>
基础系统安装</h2>
<div class="outline-text-2" id="text-2"></div>
<div id="outline-container-org736adfe" class="outline-3">
<h3 id="org736adfe"><span class="section-number-3">2.1.</span>
准备安装环境</h3>
<div class="outline-text-3" id="text-2-1"></div>
<div id="outline-container-org60dd760" class="outline-4">
<h4 id="org60dd760"><span class="section-number-4">2.1.1.</span>
引导</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>为了完成Gentoo Linux的安装、首先我们肯定要制作一个系统引导盘（LiveUSB）。Gentoo
Linux的安装跟大部分发行版的不同之处就在于它并没有提供一个有GUI或TUI界面作为安装向导的引导盘。相反，为了最大程度地客制化，它只提供了一个内置各种安装系统必备工具的不包含图形界面的基础系统；我们需要在以LiveUSB启动后<code>chroot</code>至本机磁盘手动（一般情况下）完成安装。这种繁琐安装方式给予了其最大的灵活性，真正意义上的选择之多样是Gentoo一个非常大的优势。</p>
<p>
我们可以从清华镜像源处获得LiveUSB的磁盘映像文件。官方提供了三种磁盘文件，这里我们一般选择install-amd64-mininal即可，文件地址在：我们可以从清华镜像源处获得LiveUSB的磁盘映像文件。官方提供了三种磁盘文件，这里我们一般选择<code>install-amd64-mininal</code>即可，文件地址在：</p>
<pre class="example">
https://mirrors.tuna.tsinghua.edu.cn/gentoo/releases/amd64/autobuilds/current-install-amd64-minimal/.
</pre>
<p>随后将该<code>iso</code>文件刻录到U盘上（经过了Hybrid处理，可以直接刻录到U盘上<sup><a id=
"fnr.1" class="footref" href="#fn.1" role=
"doc-backlink">1</a></sup>）。这里大家各显神通就好。谨慎的读者还可以校验一下磁盘映像文件的完整性、校验文件也在上面给出的地址下。之后将目标设备关机、插上制作好的引导盘后<b>先关闭SecureBoot后</b>启动。然后你会看到OpenRC引导这Gentoo
Linux启动，至此我们就完成了第一步：引导。</p>
</div>
</div>
<div id="outline-container-orgc2d9f9e" class="outline-4">
<h4 id="orgc2d9f9e"><span class="section-number-4">2.1.2.</span>
连接至网络</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
进入LiveUSB的环境后，先运行<code>ifconfig</code>，看看除了<code>lo</code>之外是否有别的网卡设备被检测到（比如<code>wlan</code>）。如果没有那说明你的网卡不被支持，可以到互联网上检索并寻求帮助。有的话就可以运行<code>net-setup</code>（自带的一个非常贴心的脚本），按照指引连接至网络。如果使用<code>wlan</code>，大部分网络都是WPA2/3，并建议让<code>dhcp</code>决定ip地址。</p>
<p>
随后可以<code>ping</code>一下<code>gentoo.org</code>，看看自己是否成功联网。然后视需求编辑<code>/etc/reslov.conf</code>（默認可用的编辑器有nano）。</p>
</div>
</div>
<div id="outline-container-org992e15b" class="outline-4">
<h4 id="org992e15b"><span class="section-number-4">2.1.3.</span>
磁盘分区</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
接下来是很重要的一步：给目标设备的磁盘分区。（确定你的电脑使用不是BIOS启动，如果是请参考Handbook）一般至少需要三个分区、分别是EFI分区（512MB~1024MB）、swap分区（主要是笔记本电脑休眠时使用，一般小于等于你的运行时内存大小即可）以及根分区。也是，大家各显神通就好；<a href="https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Disks">这里</a>（Introduction
to block devices至Partitioning the disk with MBR for BIOS / legacy
boot）有Gentoo官方给出的方案，以及分区工具<code>fdisk</code>的手把手教学可供参考。下面给出我的方案、仅供参考：</p>
<pre class="example">
Disk /dev/nvme0n1: 476.94 GiB, 512110190592 bytes, 1000215216 sectors
Disk model: [.*]
Units: sectors of 1 * 512 = 512 bytes
Sector size (logical/physical): 512 bytes / 512 bytes
I/O size (minimum/optimal): 512 bytes / 512 bytes
Disklabel type: gpt
Disk identifier: [.*]

Device            Start        End   Sectors   Size Type
/dev/nvme0n1p1     2048    2099199   2097152     1G Linux filesystem
/dev/nvme0n1p2  2099200    4196351   2097152     1G EFI System
/dev/nvme0n1p3  4196352   37750783  33554432    16G Linux swap
/dev/nvme0n1p4 37750784 1000214527 962463744 458.9G Linux filesystem
</pre>
<p>
我额外分出了一个<code>/boot</code>分区，即<code>/dev/nvme0n1p1</code>。分完区后使用<code>fdisk
-l
/dev/[nvme0n1|sda|.*]</code>输出你的分区方案，最好记录一下，因为之后编辑<code>/etc/fstab</code>时会用到。</p>
<p>随后给这几个分区配置不同的文件系统。EFI分区须使用FAT32、其余参考<a href=
"https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Disks">这里</a>（Creating
file systems）。这是我的方案：</p>
<div class="org-src-container">
<pre class="src src-shell">mkfs.ext4 /dev/nvme0n1p1
mkfs.vfat <span style="color: #008b8b;">-F</span> 32 /dev/nvme0n1p2
swapon /dev/nvme0n1p3
mkfs.btrfs /dev/nvme0n1p4
</pre></div>
<p>然后挂载根目录：</p>
<div class="org-src-container">
<pre class="src src-shell">mount /dev/nvme0n1p4 /mnt/gentoo
<span style="color: #483d8b;">cd</span> /mnt/gentoo
</pre></div>
<p>
顺便，Gentoo的LiveUSB是没有预装OpenZFS所需的工具的，这时候你就需要使用其它镜像，即所谓的特殊情况；注意如果选择了第三方的镜像，可能会需要额外的安装步骤，见GentooHandbook。</p>
</div>
</div>
<div id="outline-container-org29e8a99" class="outline-4">
<h4 id="org29e8a99"><span class="section-number-4">2.1.4.</span>
选择stage3档案</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>关于stage3，他们是Gentoo系统安装的种子。这时你需要作出选择：</p>
<ul class="org-ul">
<li>不喜<code>systemD</code>？选择<code>OpenRC</code>；</li>
<li>
对<code>glibc</code>感到不适？选择<code>musl-llvm</code>（注意，没有gcc和<code>glibc</code>很多软件不打补丁是编译不起来的）；</li>
<li>被迫害妄想症？选择<del>OpenBSD</del>​<code>hardened-selinux</code>；</li>
<li>喜欢禁欲？选择<code>nomultilib</code>。</li>
</ul>
<p>请选择你的毒药。stage3清单可在<a href=
"https://mirrors.tuna.tsinghua.edu.cn/gentoo/releases/amd64/autobuilds/">这里</a>查看。</p>
<p>作出选择后可使用wget或cURL将其下载到<code>/mnt/gentoo</code>下：</p>
<div class="org-src-container">
<pre class=
"src src-shell">wget https://mirrors.tuna.tsinghua.edu.cn/gentoo/releases/amd64/autobuilds/current-stage3-amd64-desktop-openrc/stage3-amd64-desktop-openrc-*.tar.xz
</pre></div>
<p>谨慎的读者这时又可以校验一下磁盘映像文件的完整性了。然后使用：</p>
<div class="org-src-container">
<pre class="src src-shell">tar xpvf stage3-*.tar.xz <span style=
"color: #483d8b;">--xattrs-include=</span><span style=
"color: #483d8b;">'*.*'</span> <span style=
"color: #008b8b;">--numeric-owner</span>
</pre></div>
<p>解压。注意，一定要用这个命令解压。参数解释在Handbook中有，按需食用。</p>
</div>
</div>
